// Дан массив из 10 целых чисел в диапозоне от [-99,60] заменить в этом массиве отрицательные числа на 0
Console.Clear();

// int[] array = new int [10];
// int index = 0;
// while (index < 10)
// {
//     array[index] = new Random().Next(-99,60);
//     Console.Write($"{array[index]}, ");
//     index++;
// }
// Console.WriteLine();
// 
// int k = 0;
// while (k<10)
// {
// if (array[k] < 0) array [k] = 0;
// Console.Write($"{array[k]}, ");
// k++;
// }

